# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

m = int(input("Введите трехзначное число: "))
sum = 0

a = m // 100
b = (m // 10) % 10
c = (m % 100) % 10
print(a + b + c)
